load-test/results-peak.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00.0s/30s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  01.0s/30s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  02.0s/30s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  03.1s/30s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  04.0s/30s

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  05.0s/30s

running (0m07.0s), 50/50 VUs, 16 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  06.0s/30s

running (0m08.0s), 50/50 VUs, 41 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  07.0s/30s

running (0m09.0s), 50/50 VUs, 49 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  08.0s/30s

running (0m10.0s), 50/50 VUs, 63 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  09.0s/30s

running (0m11.0s), 50/50 VUs, 83 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  10.0s/30s

running (0m12.0s), 50/50 VUs, 93 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  11.0s/30s

running (0m13.0s), 50/50 VUs, 93 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  12.0s/30s

running (0m14.0s), 50/50 VUs, 98 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  13.0s/30s

running (0m15.0s), 50/50 VUs, 98 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  14.0s/30s

running (0m16.0s), 50/50 VUs, 105 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  15.0s/30s

running (0m17.0s), 50/50 VUs, 126 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  16.0s/30s

running (0m18.0s), 50/50 VUs, 141 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  17.0s/30s

running (0m19.0s), 50/50 VUs, 144 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  18.0s/30s

running (0m20.0s), 50/50 VUs, 154 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  19.0s/30s

running (0m21.0s), 50/50 VUs, 178 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  20.0s/30s

running (0m22.0s), 50/50 VUs, 189 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  21.0s/30s

running (0m23.0s), 50/50 VUs, 204 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  22.0s/30s

running (0m24.0s), 50/50 VUs, 215 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  23.0s/30s

running (0m25.0s), 50/50 VUs, 227 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  24.0s/30s

running (0m26.0s), 50/50 VUs, 233 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  25.0s/30s

running (0m27.0s), 50/50 VUs, 248 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  26.0s/30s

running (0m28.0s), 50/50 VUs, 271 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  27.0s/30s

running (0m29.0s), 50/50 VUs, 286 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  28.0s/30s

running (0m30.0s), 50/50 VUs, 297 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  29.0s/30s

running (0m31.0s), 50/50 VUs, 325 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

running (0m32.0s), 34/50 VUs, 341 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

running (0m33.0s), 19/50 VUs, 356 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s
     ✗ POST /Auth/login status is 200
      ↳  0% — ✓ 0 / ✗ 375
     ✗ POST /Auth/login response time < 2s
      ↳  74% — ✓ 279 / ✗ 96
     ✗ POST /Bookings server responded
      ↳  99% — ✓ 374 / ✗ 1
     ✗ POST /Bookings response time < 2s
      ↳  75% — ✓ 284 / ✗ 91

     checks.........................: 62.46% ✓ 937       ✗ 563 
     data_received..................: 624 kB 19 kB/s
     data_sent......................: 481 kB 15 kB/s
     http_req_blocked...............: avg=13.76ms  min=0s      med=0s    max=508.43ms p(90)=0s      p(95)=189.88ms
     http_req_connecting............: avg=3.78ms   min=0s      med=0s    max=61.33ms  p(90)=0s      p(95)=53.79ms 
   ✗ http_req_duration..............: avg=1.57s    min=70.08ms med=1.04s max=13.82s   p(90)=2.94s   p(95)=3.96s   
       { expected_response:true }...: avg=1.55s    min=70.08ms med=1.04s max=13.82s   p(90)=2.93s   p(95)=3.96s   
   ✓ http_req_failed................: 0.13%  ✓ 1         ✗ 754 
     http_req_receiving.............: avg=396.27µs min=0s      med=0s    max=112.44ms p(90)=644.7µs p(95)=899.71µs
     http_req_sending...............: avg=44.15µs  min=0s      med=0s    max=8.63ms   p(90)=0s      p(95)=0s      
     http_req_tls_handshaking.......: avg=9.56ms   min=0s      med=0s    max=157.56ms p(90)=0s      p(95)=134.65ms
     http_req_waiting...............: avg=1.57s    min=70.08ms med=1.04s max=13.82s   p(90)=2.94s   p(95)=3.96s   
     http_reqs......................: 755    22.844044/s
     iteration_duration.............: avg=4.19s    min=1.29s   med=3.33s max=19.09s   p(90)=6.27s   p(95)=6.42s   
     iterations.....................: 375    11.346379/s
     vus............................: 19     min=19      max=50
     vus_max........................: 50     min=50      max=50

running (0m33.1s), 00/50 VUs, 375 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s